cfd/K_006/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  14
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


solver          incompressibleFluid;
startFrom       latestTime;
startTime       0;
stopAt          endTime;
endTime         4000;
deltaT          1;
writeControl    timeStep;
writeInterval   500;
purgeWrite      2;
writeFormat     binary;
writePrecision  8;
timeFormat      general;
runTimeModifiable true;

functions
{
    forze
    {
        type            forceCoeffs;
        libs            ("libforces.so");
        writeControl    timeStep;
        writeInterval   10;
        patches         (corpo presa scarico);
        rho             rhoInf;
        rhoInf          1;
        CofR            (0 0 0);
        liftDir         (0 1 0);
        dragDir         (1 0 0);
        pitchAxis       (0 0 1);
        magUInf         1;
        lRef            1;
        Aref            1;
    }

        ptot
        {
            type            pressure;
            libs            ("libfieldFunctionObjects.so");
            calcTotal       yes;
            calcCoeff       no;
            rho             rhoInf;
            rhoInf          1;
            pRef            0;
            executeControl  timeStep;
            writeControl    writeTime;
        }
        bil_presa
        {
            type            surfaceFieldValue;
            libs            ("libfieldFunctionObjects.so");
            writeControl    timeStep;
            writeInterval   10;
            writeFields     false;
            patch           presa;
            operation       sum;
            weightField     phi;
            fields          (U total(p));
        }
        Q_presa
        {
            type            surfaceFieldValue;
            libs            ("libfieldFunctionObjects.so");
            writeControl    timeStep;
            writeInterval   10;
            writeFields     false;
            patch           presa;
            operation       sum;
            fields          (phi);
        }
        bil_scarico
        {
            type            surfaceFieldValue;
            libs            ("libfieldFunctionObjects.so");
            writeControl    timeStep;
            writeInterval   10;
            writeFields     false;
            patch           scarico;
            operation       sum;
            weightField     phi;
            fields          (U total(p));
        }
        Q_scarico
        {
            type            surfaceFieldValue;
            libs            ("libfieldFunctionObjects.so");
            writeControl    timeStep;
            writeInterval   10;
            writeFields     false;
            patch           scarico;
            operation       sum;
            fields          (phi);
        }

    yPlus { type yPlus; libs ("libfieldFunctionObjects.so"); writeControl writeTime; }
    wallShearStress { type wallShearStress; libs ("libfieldFunctionObjects.so"); patches (corpo); writeControl writeTime; }
}
