cfd/K_006/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  14
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 -0)
    (0.731648018 0.0660373372 -0.00288325241)
    (0.731648018 0.0660373372 0.00288325241)
    (0.898 0.0490377782 -0.00214103563)
    (0.898 0.0490377782 0.00214103563)
    (0.904 0.0473411055 -0.0020669573)
    (0.904 0.0473411055 0.0020669573)
    (0.910181069 0.0454713385 -0.00198532151)
    (0.910181069 0.0454713385 0.00198532151)
    (1 0 -0)
    (-4 0 -0)
    (0.731648018 3.9904332 -0.174226076)
    (0.731648018 3.9904332 0.174226076)
    (0.898 3.99536127 -0.17444124)
    (0.898 3.99536127 0.17444124)
    (0.904 3.99545624 -0.174445387)
    (0.904 3.99545624 0.174445387)
    (0.910181069 3.99554805 -0.174449395)
    (0.910181069 3.99554805 0.174449395)
    (1 3.99619289 -0.174477549)
    (1 3.99619289 0.174477549)
    (8 0 -0)
    (8 3.99619289 -0.174477549)
    (8 3.99619289 0.174477549)
);

blocks
(
    hex (0 1 11 10 0 2 12 10) (110 110 1)
    edgeGrading (((0.3 0.4 6) (0.7 0.6 3)) ((0.3 0.4 6) (0.7 0.6 3)) ((0.3 0.4 6) (0.7 0.6 3)) ((0.3 0.4 6) (0.7 0.6 3))  ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097))  1 1 1 1)
    hex (1 3 13 11 2 4 14 12) (70 110 1)
    edgeGrading (((0.7 0.6 1) (0.3 0.4 0.15)) ((0.7 0.6 1) (0.3 0.4 0.15)) ((0.7 0.6 1) (0.3 0.4 0.15)) ((0.7 0.6 1) (0.3 0.4 0.15))  ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097))  1 1 1 1)
    hex (3 5 15 13 4 6 16 14) (16 110 1)
    edgeGrading (1 1 1 1  ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097))  1 1 1 1)
    hex (5 7 17 15 6 8 18 16) (12 110 1)
    edgeGrading (1 1 1 1  ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097))  1 1 1 1)
    hex (7 9 19 17 8 9 20 18) (60 110 1)
    edgeGrading (((0.3 0.5 3) (0.7 0.5 0.3)) ((0.3 0.5 3) (0.7 0.5 0.3)) ((0.3 0.5 3) (0.7 0.5 0.3)) ((0.3 0.5 3) (0.7 0.5 0.3))  ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097))  1 1 1 1)
    hex (9 21 22 19 9 21 23 20) (160 110 1)
    edgeGrading (40 40 40 40  ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097))  1 1 1 1)
);

edges
(
...
    polyLine 10 11 ((-3.99315973 0.208960684 -0.00912342048) (-3.97265762 0.417349628 -0.0182218783) (-3.93854978 0.624596659 -0.0272704791) (-3.89092953 0.830134724 -0.0362444648) (-3.82992716 1.03340145 -0.0451192817) (-3.75570958 1.23384068 -0.0538706474) (-3.66847986 1.43090398 -0.062474617) (-3.56847667 1.62405218 -0.0709076493) (-3.45597363 1.81275678 -0.0791466705) (-3.33127856 1.99650149 -0.0871691377) (-3.19473263 2.17478356 -0.0949531007) (-3.04670946 2.34711517 -0.102477262) (-2.88761405 2.51302483 -0.109721033) (-2.7178817 2.67205857 -0.116664597) (-2.53797682 2.82378127 -0.123288953) (-2.34839165 2.96777779 -0.129575977) (-2.14964491 3.10365415 -0.135508467) (-1.9422804 3.23103857 -0.141070191) (-1.72686549 3.34958252 -0.146245931) (-1.50398958 3.45896164 -0.151021527) (-1.27426248 3.55887667 -0.155383911) (-1.03831274 3.64905422 -0.159321148) (-0.796785965 3.72924756 -0.162822465) (-0.550342983 3.79923727 -0.165878282) (-0.299658093 3.85883185 -0.168480237) (-0.0454171965 3.90786825 -0.170621212) (0.211684076 3.94621229 -0.172295349) (0.470942267 3.97375906 -0.173498068))
...
    polyLine 10 12 ((-3.99315973 0.208960684 0.00912342048) (-3.97265762 0.417349628 0.0182218783) (-3.93854978 0.624596659 0.0272704791) (-3.89092953 0.830134724 0.0362444648) (-3.82992716 1.03340145 0.0451192817) (-3.75570958 1.23384068 0.0538706474) (-3.66847986 1.43090398 0.062474617) (-3.56847667 1.62405218 0.0709076493) (-3.45597363 1.81275678 0.0791466705) (-3.33127856 1.99650149 0.0871691377) (-3.19473263 2.17478356 0.0949531007) (-3.04670946 2.34711517 0.102477262) (-2.88761405 2.51302483 0.109721033) (-2.7178817 2.67205857 0.116664597) (-2.53797682 2.82378127 0.123288953) (-2.34839165 2.96777779 0.129575977) (-2.14964491 3.10365415 0.135508467) (-1.9422804 3.23103857 0.141070191) (-1.72686549 3.34958252 0.146245931) (-1.50398958 3.45896164 0.151021527) (-1.27426248 3.55887667 0.155383911) (-1.03831274 3.64905422 0.159321148) (-0.796785965 3.72924756 0.162822465) (-0.550342983 3.79923727 0.165878282) (-0.299658093 3.85883185 0.168480237) (-0.0454171965 3.90786825 0.170621212) (0.211684076 3.94621229 0.172295349) (0.470942267 3.97375906 0.173498068))
    polyLine 1 3 ((0.736275382 0.0660310368 -0.00288297733) (0.740876837 0.0660108719 -0.00288209691) (0.745451877 0.0659762914 -0.00288058709) (0.75 0.0659267457 -0.00287842388) (0.754520708 0.0658616876 -0.00287558338) (0.759013505 0.065780574 -0.00287204188) (0.763477898 0.0656828676 -0.00286777593) (0.767913397 0.0655680384 -0.00286276238) (0.772319518 0.0654355651 -0.00285697847) (0.776695775 0.0652849369 -0.0028504019) (0.781041689 0.0651156549 -0.00284301089) (0.785356784 0.0649272341 -0.00283478426) (0.789640586 0.0647192048 -0.00282570151) (0.793892626 0.0644911144 -0.00281574286) (0.798112437 0.0642425287 -0.00280488938) (0.802299557 0.063973034 -0.00279312298) (0.806453527 0.0636822384 -0.00278042658) (0.81057389 0.0633697738 -0.00276678408) (0.814660196 0.0630352968 -0.0027521805) (0.818711995 0.0626784912 -0.00273660203) (0.822728844 0.0622990686 -0.00272003608) (0.826710302 0.0618967706 -0.00270247137) (0.830655933 0.0614713699 -0.00268389797) (0.834565303 0.0610226718 -0.00266430739) (0.838437985 0.0605505157 -0.00264369261) (0.842273553 0.0600547761 -0.00262204815) (0.846071587 0.0595353641 -0.00259937013) (0.84983167 0.0589922286 -0.00257565633) (0.853553391 0.0584253572 -0.00255090618) (0.85723634 0.0578347774 -0.00252512091) (0.860880114 0.0572205574 -0.00249830349) (0.864484314 0.0565828075 -0.00247045873) (0.868048544 0.05592168 -0.00244159328) (0.871572413 0.0552373708 -0.00241171569) (0.875055535 0.0545301195 -0.00238083643) (0.878497528 0.0538002099 -0.00234896789) (0.881898014 0.053047971 -0.00231612443) (0.885256621 0.0522737764 -0.00228232237) (0.888572981 0.0514780455 -0.00224758001) (0.891846729 0.050661243 -0.00221191764) (0.895077506 0.0498238788 -0.00217535753))
    polyLine 11 13 ((0.737380399 3.99067681 -0.174236712) (0.743113126 3.99091516 -0.174247119) (0.748846193 3.99114825 -0.174257296) (0.75457959 3.99137608 -0.174267243) (0.760313311 3.99159864 -0.17427696) (0.766047347 3.99181595 -0.174286448) (0.771781692 3.99202799 -0.174295706) (0.777516338 3.99223478 -0.174304735) (0.783251277 3.9924363 -0.174313533) (0.788986502 3.99263255 -0.174322102) (0.794722005 3.99282355 -0.174330441) (0.800457778 3.99300928 -0.17433855) (0.806193815 3.99318975 -0.17434643) (0.811930107 3.99336496 -0.174354079) (0.817666647 3.9935349 -0.174361499) (0.823403427 3.99369958 -0.174368689) (0.82914044 3.99385899 -0.174375649) (0.834877678 3.99401314 -0.17438238) (0.840615134 3.99416202 -0.17438888) (0.8463528 3.99430564 -0.174395151) (0.852090669 3.994444 -0.174401191) (0.857828732 3.99457709 -0.174407002) (0.863566983 3.99470491 -0.174412583) (0.869305414 3.99482747 -0.174417934) (0.875044017 3.99494476 -0.174423055) (0.880782784 3.99505679 -0.174427946) (0.886521709 3.99516355 -0.174432608) (0.892260784 3.99526504 -0.174437039))
    polyLine 2 4 ((0.736275382 0.0660310368 0.00288297733) (0.740876837 0.0660108719 0.00288209691) (0.745451877 0.0659762914 0.00288058709) (0.75 0.0659267457 0.00287842388) (0.754520708 0.0658616876 0.00287558338) (0.759013505 0.065780574 0.00287204188) (0.763477898 0.0656828676 0.00286777593) (0.767913397 0.0655680384 0.00286276238) (0.772319518 0.0654355651 0.00285697847) (0.776695775 0.0652849369 0.0028504019) (0.781041689 0.0651156549 0.00284301089) (0.785356784 0.0649272341 0.00283478426) (0.789640586 0.0647192048 0.00282570151) (0.793892626 0.0644911144 0.00281574286) (0.798112437 0.0642425287 0.00280488938) (0.802299557 0.063973034 0.00279312298) (0.806453527 0.0636822384 0.00278042658) (0.81057389 0.0633697738 0.00276678408) (0.814660196 0.0630352968 0.0027521805) (0.818711995 0.0626784912 0.00273660203) (0.822728844 0.0622990686 0.00272003608) (0.826710302 0.0618967706 0.00270247137) (0.830655933 0.0614713699 0.00268389797) (0.834565303 0.0610226718 0.00266430739) (0.838437985 0.0605505157 0.00264369261) (0.842273553 0.0600547761 0.00262204815) (0.846071587 0.0595353641 0.00259937013) (0.84983167 0.0589922286 0.00257565633) (0.853553391 0.0584253572 0.00255090618) (0.85723634 0.0578347774 0.00252512091) (0.860880114 0.0572205574 0.00249830349) (0.864484314 0.0565828075 0.00247045873) (0.868048544 0.05592168 0.00244159328) (0.871572413 0.0552373708 0.00241171569) (0.875055535 0.0545301195 0.00238083643) (0.878497528 0.0538002099 0.00234896789) (0.881898014 0.053047971 0.00231612443) (0.885256621 0.0522737764 0.00228232237) (0.888572981 0.0514780455 0.00224758001) (0.891846729 0.050661243 0.00221191764) (0.895077506 0.0498238788 0.00217535753))
    polyLine 12 14 ((0.737380399 3.99067681 0.174236712) (0.743113126 3.99091516 0.174247119) (0.748846193 3.99114825 0.174257296) (0.75457959 3.99137608 0.174267243) (0.760313311 3.99159864 0.17427696) (0.766047347 3.99181595 0.174286448) (0.771781692 3.99202799 0.174295706) (0.777516338 3.99223478 0.174304735) (0.783251277 3.9924363 0.174313533) (0.788986502 3.99263255 0.174322102) (0.794722005 3.99282355 0.174330441) (0.800457778 3.99300928 0.17433855) (0.806193815 3.99318975 0.17434643) (0.811930107 3.99336496 0.174354079) (0.817666647 3.9935349 0.174361499) (0.823403427 3.99369958 0.174368689) (0.82914044 3.99385899 0.174375649) (0.834877678 3.99401314 0.17438238) (0.840615134 3.99416202 0.17438888) (0.8463528 3.99430564 0.174395151) (0.852090669 3.994444 0.174401191) (0.857828732 3.99457709 0.174407002) (0.863566983 3.99470491 0.174412583) (0.869305414 3.99482747 0.174417934) (0.875044017 3.99494476 0.174423055) (0.880782784 3.99505679 0.174427946) (0.886521709 3.99516355 0.174432608) (0.892260784 3.99526504 0.174437039))
    polyLine 3 5 ((0.898264959 0.0489665087 -0.00213792394) (0.901408738 0.0480897333 -0.0020996431))
    polyLine 13 15 ((0.898206894 3.99536464 -0.174441388) (0.898413788 3.99536801 -0.174441534) (0.898620683 3.99537136 -0.174441681) (0.898827578 3.99537471 -0.174441827) (0.899034473 3.99537806 -0.174441973) (0.899241368 3.99538139 -0.174442119) (0.899448263 3.99538472 -0.174442264) (0.899655158 3.99538804 -0.174442409) (0.899862054 3.99539136 -0.174442554) (0.900068949 3.99539467 -0.174442699) (0.900275845 3.99539797 -0.174442843) (0.900482741 3.99540127 -0.174442987) (0.900689638 3.99540456 -0.17444313) (0.900896534 3.99540784 -0.174443273) (0.90110343 3.99541111 -0.174443416) (0.901310327 3.99541438 -0.174443559) (0.901517224 3.99541764 -0.174443702) (0.901724121 3.9954209 -0.174443844) (0.901931018 3.99542414 -0.174443985) (0.902137916 3.99542738 -0.174444127) (0.902344813 3.99543062 -0.174444268) (0.902551711 3.99543384 -0.174444409) (0.902758609 3.99543706 -0.17444455) (0.902965507 3.99544028 -0.17444469) (0.903172405 3.99544348 -0.17444483) (0.903379304 3.99544668 -0.17444497) (0.903586202 3.99544988 -0.174445109) (0.903793101 3.99545306 -0.174445248))
    polyLine 4 6 ((0.898264959 0.0489665087 0.00213792394) (0.901408738 0.0480897333 0.0020996431))
    polyLine 14 16 ((0.898206894 3.99536464 0.174441388) (0.898413788 3.99536801 0.174441534) (0.898620683 3.99537136 0.174441681) (0.898827578 3.99537471 0.174441827) (0.899034473 3.99537806 0.174441973) (0.899241368 3.99538139 0.174442119) (0.899448263 3.99538472 0.174442264) (0.899655158 3.99538804 0.174442409) (0.899862054 3.99539136 0.174442554) (0.900068949 3.99539467 0.174442699) (0.900275845 3.99539797 0.174442843) (0.900482741 3.99540127 0.174442987) (0.900689638 3.99540456 0.17444313) (0.900896534 3.99540784 0.174443273) (0.90110343 3.99541111 0.174443416) (0.901310327 3.99541438 0.174443559) (0.901517224 3.99541764 0.174443702) (0.901724121 3.9954209 0.174443844) (0.901931018 3.99542414 0.174443985) (0.902137916 3.99542738 0.174444127) (0.902344813 3.99543062 0.174444268) (0.902551711 3.99543384 0.174444409) (0.902758609 3.99543706 0.17444455) (0.902965507 3.99544028 0.17444469) (0.903172405 3.99544348 0.17444483) (0.903379304 3.99544668 0.17444497) (0.903586202 3.99544988 0.174445109) (0.903793101 3.99545306 0.174445248))
    polyLine 5 7 ((0.904508497 0.0471941983 -0.0020605432) (0.907563898 0.0462805936 -0.00202065435))
    polyLine 15 17 ((0.904213138 3.99545951 -0.174445529) (0.904426276 3.99546277 -0.174445672) (0.904639414 3.99546602 -0.174445814) (0.904852553 3.99546927 -0.174445956) (0.905065691 3.99547251 -0.174446097) (0.90527883 3.99547574 -0.174446238) (0.905491969 3.99547896 -0.174446379) (0.905705108 3.99548218 -0.174446519) (0.905918247 3.99548539 -0.174446659) (0.906131387 3.99548859 -0.174446799) (0.906344526 3.99549178 -0.174446939) (0.906557666 3.99549497 -0.174447078) (0.906770806 3.99549815 -0.174447217) (0.906983946 3.99550133 -0.174447355) (0.907197087 3.99550449 -0.174447494) (0.907410227 3.99550765 -0.174447631) (0.907623368 3.9955108 -0.174447769) (0.907836509 3.99551395 -0.174447906) (0.90804965 3.99551708 -0.174448043) (0.908262791 3.99552021 -0.17444818) (0.908475932 3.99552334 -0.174448316) (0.908689074 3.99552645 -0.174448452) (0.908902215 3.99552956 -0.174448588) (0.909115357 3.99553266 -0.174448723) (0.909328499 3.99553575 -0.174448858) (0.909541641 3.99553884 -0.174448993) (0.909754783 3.99554192 -0.174449128) (0.909967926 3.99554499 -0.174449262))
    polyLine 6 8 ((0.904508497 0.0471941983 0.0020605432) (0.907563898 0.0462805936 0.00202065435))
    polyLine 16 18 ((0.904213138 3.99545951 0.174445529) (0.904426276 3.99546277 0.174445672) (0.904639414 3.99546602 0.174445814) (0.904852553 3.99546927 0.174445956) (0.905065691 3.99547251 0.174446097) (0.90527883 3.99547574 0.174446238) (0.905491969 3.99547896 0.174446379) (0.905705108 3.99548218 0.174446519) (0.905918247 3.99548539 0.174446659) (0.906131387 3.99548859 0.174446799) (0.906344526 3.99549178 0.174446939) (0.906557666 3.99549497 0.174447078) (0.906770806 3.99549815 0.174447217) (0.906983946 3.99550133 0.174447355) (0.907197087 3.99550449 0.174447494) (0.907410227 3.99550765 0.174447631) (0.907623368 3.9955108 0.174447769) (0.907836509 3.99551395 0.174447906) (0.90804965 3.99551708 0.174448043) (0.908262791 3.99552021 0.17444818) (0.908475932 3.99552334 0.174448316) (0.908689074 3.99552645 0.174448452) (0.908902215 3.99552956 0.174448588) (0.909115357 3.99553266 0.174448723) (0.909328499 3.99553575 0.174448858) (0.909541641 3.99553884 0.174448993) (0.909754783 3.99554192 0.174449128) (0.909967926 3.99554499 0.174449262))
...
    polyLine 17 19 ((0.913277957 3.99559176 -0.174451304) (0.916374879 3.99563393 -0.174453145) (0.919471832 3.99567456 -0.174454919) (0.922568817 3.99571367 -0.174456626) (0.925665831 3.99575124 -0.174458267) (0.928762874 3.99578727 -0.17445984) (0.931859944 3.99582178 -0.174461346) (0.934957041 3.99585475 -0.174462786) (0.938054162 3.99588618 -0.174464159) (0.941151307 3.99591609 -0.174465464) (0.944248475 3.99594446 -0.174466703) (0.947345664 3.99597129 -0.174467874) (0.950442873 3.9959966 -0.174468979) (0.953540102 3.99602037 -0.174470017) (0.956637348 3.9960426 -0.174470988) (0.95973461 3.9960633 -0.174471892) (0.962831889 3.99608247 -0.174472729) (0.965929181 3.99610011 -0.174473499) (0.969026487 3.99611621 -0.174474202) (0.972123804 3.99613078 -0.174474838) (0.975221132 3.99614381 -0.174475407) (0.97831847 3.99615531 -0.174475909) (0.981415816 3.99616528 -0.174476344) (0.984513169 3.99617372 -0.174476713) (0.987610528 3.99618062 -0.174477014) (0.990707892 3.99618599 -0.174477248) (0.993805259 3.99618982 -0.174477416) (0.996902629 3.99619212 -0.174477516))
...
    polyLine 18 20 ((0.913277957 3.99559176 0.174451304) (0.916374879 3.99563393 0.174453145) (0.919471832 3.99567456 0.174454919) (0.922568817 3.99571367 0.174456626) (0.925665831 3.99575124 0.174458267) (0.928762874 3.99578727 0.17445984) (0.931859944 3.99582178 0.174461346) (0.934957041 3.99585475 0.174462786) (0.938054162 3.99588618 0.174464159) (0.941151307 3.99591609 0.174465464) (0.944248475 3.99594446 0.174466703) (0.947345664 3.99597129 0.174467874) (0.950442873 3.9959966 0.174468979) (0.953540102 3.99602037 0.174470017) (0.956637348 3.9960426 0.174470988) (0.95973461 3.9960633 0.174471892) (0.962831889 3.99608247 0.174472729) (0.965929181 3.99610011 0.174473499) (0.969026487 3.99611621 0.174474202) (0.972123804 3.99613078 0.174474838) (0.975221132 3.99614381 0.174475407) (0.97831847 3.99615531 0.174475909) (0.981415816 3.99616528 0.174476344) (0.984513169 3.99617372 0.174476713) (0.987610528 3.99618062 0.174477014) (0.990707892 3.99618599 0.174477248) (0.993805259 3.99618982 0.174477416) (0.996902629 3.99619212 0.174477516))
);

defaultPatch { name defaultFaces; type empty; }

boundary
(
    corpo { type wall; faces ((0 1 2 0) (1 3 4 2) (7 9 9 8)); }
    esterno { type patch; faces ((10 11 12 10) (11 13 14 12) (13 15 16 14) (15 17 18 16) (17 19 20 18) (19 22 23 20)); }
    front { type wedge; faces ((0 1 11 10) (1 3 13 11) (3 5 15 13) (5 7 17 15) (7 9 19 17) (9 21 22 19)); }
    back { type wedge; faces ((0 10 12 2) (2 12 14 4) (4 14 16 6) (6 16 18 8) (8 18 20 9) (9 20 23 21)); }
    presa { type patch; faces ((3 5 6 4)); }
    scarico { type patch; faces ((5 7 8 6)); }
    uscita { type patch; faces ((21 22 23 21)); }
);
